In [1]:
import pandas as pd
import numpy as np

In [2]:
data={
    'S.no':[1,2,3,4,5],
    'Movie_name':['pathan','inception','titanic','spiderman','tube light'],
    'Ratings':['3 star','5 star','4 star','4 star','2 star']
}
data

{'S.no': [1, 2, 3, 4, 5],
 'Movie_name': ['pathan', 'inception', 'titanic', 'spiderman', 'tube light'],
 'Ratings': ['3 star', '5 star', '4 star', '4 star', '2 star']}

In [3]:
df=pd.DataFrame(data)
df

   S.no  Movie_name Ratings
0     1      pathan  3 star
1     2   inception  5 star
2     3     titanic  4 star
3     4   spiderman  4 star
4     5  tube light  2 star

In [4]:
df.to_excel('movie.xlsx')
movie=pd.read_excel('movie.xlsx',index_col=0)

In [5]:
movie

   S.no  Movie_name Ratings
0     1      pathan  3 star
1     2   inception  5 star
2     3     titanic  4 star
3     4   spiderman  4 star
4     5  tube light  2 star

In [6]:
movie.Ratings.value_counts()

4 star    2
5 star    1
3 star    1
2 star    1
Name: Ratings, dtype: int64

In [7]:
movie.dtypes

S.no           int64
Movie_name    object
Ratings       object
dtype: object

In [8]:
movie.replace(['2 star','3 star','4 star','5 star'],[2,3,4,5])

   S.no  Movie_name  Ratings
0     1      pathan        3
1     2   inception        5
2     3     titanic        4
3     4   spiderman        4
4     5  tube light        2

In [9]:
movie['Ratings']=movie['Ratings'].astype('category')

In [10]:
movie['Ratings_new']=movie['Ratings'].cat.codes
#converting catergorical values from 0 to n

In [11]:
movie

   S.no  Movie_name Ratings  Ratings_new
0     1      pathan  3 star            1
1     2   inception  5 star            3
2     3     titanic  4 star            2
3     4   spiderman  4 star            2
4     5  tube light  2 star            0

In [12]:
movie.dtypes

S.no              int64
Movie_name       object
Ratings        category
Ratings_new        int8
dtype: object

In [13]:
pd.get_dummies(movie,columns=['Ratings'])
#one hot encoding
51

,S.no,Movie_name,Ratings_new,Ratings_2 star,Ratings_3 star,Ratings_4 star,Ratings_5 star
0,1,pathan,1,0,1,0,0
1,2,inception,3,0,0,0,1
2,3,titanic,2,0,0,1,0
3,4,spiderman,2,0,0,1,0
4,5,tube light,0,1,0,0,0

In [14]:
from sklearn.preprocessing import OrdinalEncoder
#ordinal encoding

In [15]:
obj=OrdinalEncoder()

In [16]:
movie['encode']=obj.fit_transform(movie[['Ratings']])

In [17]:
movie

   S.no  Movie_name Ratings  Ratings_new  encode
0     1      pathan  3 star            1     1.0
1     2   inception  5 star            3     3.0
2     3     titanic  4 star            2     2.0
3     4   spiderman  4 star            2     2.0
4     5  tube light  2 star            0     0.0